swinger-backend/app/controllers/api/v1/notes_controller.rb

  def index
    notes = Note.all
---
SELECT "notes".* FROM "notes"

  def create
    note = Note.new(role_id: params[:role_id], scene_id: params[:scene_id], body: params[:body])

    if note.valid?
      note.save
---
INSERT INTO "notes" ("body", "role_id", "scene_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", ""], ["role_id", 1], ["scene_id", 6], ["created_at", "2018-01-02 12:59:09.297960"], ["updated_at", "2018-01-02 12:59:09.297960"]]