swinger-backend/app/controllers/api/v1/roles_controller.rb

    def index
    roles = Role.all
---
SELECT "roles".* FROM "roles"

  def create
    show = Show.all.find_by(name: params[:show])
    role = Role.new(name: params[:name], show_id: show.id)

    if role.valid?
      role.save
---
SELECT  "shows".* FROM "shows" WHERE "shows"."name" = $1 LIMIT $2  [["name", "Ne Shooooo"], ["LIMIT", 1]]
INSERT INTO "roles" ("name", "show_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gladys"], ["show_id", 7], ["created_at", "2017-12-31 13:22:45.830787"], ["updated_at", "2017-12-31 13:22:45.830787"]]