swinger-backend/app/controllers/api/v1/scenes_controller.rb

    def index
    scenes = Scene.all
---
SELECT "scenes".* FROM "scenes"

  def create
    show = Show.all.find_by(name: params[:show])

    scene = Scene.new(number: params[:number], act: params[:act], show_id: show.id)

    if scene.valid?
      scene.save
---
SELECT  "shows".* FROM "shows" WHERE "shows"."name" = $1 LIMIT $2  [["name", "Little Shop of Horrors"], ["LIMIT", 1]]
INSERT INTO "scenes" ("number", "show_id", "created_at", "updated_at", "act") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 8], ["show_id", 3], ["created_at", "2017-12-31 12:51:55.232302"], ["updated_at", "2017-12-31 12:51:55.232302"], ["act", 1]]
INSERT INTO "shows" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Little Shop of Horrors"], ["created_at", "2017-12-31 12:51:55.037505"], ["updated_at", "2017-12-31 12:51:55.037505"]]