swinger-backend/app/controllers/api/v1/shows_controller.rb

  def set_show
    @show = Show.find(params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]