swinger-backend/app/controllers/api/v1/shows_controller.rb

SELECT "shows".* FROM "shows"
---
  def index
    @shows = Show.all

INSERT INTO "shows" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "My Fair Lady"], ["created_at", "2017-12-31 00:26:09.074952"], ["updated_at", "2017-12-31 00:26:09.074952"]]
---
  def create
    show = Show.new(name: params[:title])

    if show.valid?
      show.save

SELECT  "shows".* FROM "shows" WHERE "shows"."name" = $1 LIMIT $2  [["name", "undefined"], ["LIMIT", 1]]
---
  def show
    byebug
    @show = Show.find_by(name: params[:id])