swinger-backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Erik"], ["password", "yes"], ["created_at", "2018-01-31 15:19:13.838734"], ["updated_at", "2018-01-31 15:19:13.838734"]]
---
  def create
    new_user = User.new(user_params)

    if new_user.valid?
      new_user.save

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def show
    render json: UserSerializer.new(User.first)